"""
Создайте приложение для эмуляции работа киоска
по продаже хот-догов. Приложение должно иметь следующую функциональность:

1. Пользователь может выбрать из трёх стандартных рецептов хот-дога или создать свой рецепт.
2. Пользователь может выбирать добавлять ли майонез, горчицу, кетчуп, топпинги (сладкий лук, халапеньо,
чили, соленный огурец и т.д.).
3. Информацию о заказанном хот-доге нужно отображать на экран.
5. При покупке, производится расчет, в ходе которого у клиента может не хватить денег.
6. Классы приложения должны быть построены с учетом принципов SOLID и паттернов проектирования.

Приложение можно создать как с нуля, так и переделав приложение для пиццы, что находится в архиве
"""


def main():
    pass


if __name__ == "__main__":
    main()
