"""
Написать программу с использованием библиотеки SQLAlchemy, которая:

1. Создаёт на сервере базу данных для какой-нибудь игры;
2. Создаёт в этой базе таблицу игроков, где для каждого игрока определён:
    2.1. Ник
    2.2. Уровень
    2.3. Сила
    2.4. Ловкость
    2.5. Интеллект
    2.6. И/или любые другие игровые параметры;
3. Наполняет таблицу данными (от 10 строк);
4. Делает выборку/группировку по условию, основанному на игровых параметрах.

В личный кабинет загрузить .py файл с исходным ходом программы.
"""

import mysql.connector


def main():
    pass


if __name__ == "__main__":
    main()
